//
//  1.swift
//  DreamTeam2.8
//
//  Created by Apple on 13.06.2020.
//  Copyright © 2020 Aleksandr Kovalov. All rights reserved.
//

class InfoDishesDataManager {
    
    static let sharedDishes = InfoDishesDataManager()
    
    private init() {}
    
    let fishWithRiceAndVegetablesInfo =  """
1.Рис опустить в подсоленную воду, отварить до почти полной готовности, затем промыть, отложить.
2.Нарезать филе рыбы, приправить чесноком, перцами, цедрой, оставить на некоторое время для маринования.
3.Добавить в рис помидор, нарезанный кусочками, кружками нарезанный лук-порей и редис, а также смесь овощей, размешать, полить маслом, добавить небольшое количество воды.
4.Выстелить противень фольгой, выложить рис и рыбу, чередуя – полосками, тщательно завернуть все фольгой так, чтобы щелей не было.
5.Готовить рис с рыбой и овощами по-восточному в разогретой до 200 градусов духовке около 40-50 мин, перед подачей оформить лимоном и зеленью.
"""
    
    let rusticPotatoInfo = """
1.Помойте хорошо картофель и почистите кожуру. Каждый кусочек картофеля порежьте на 6-8 частей.
2.Для приготовления заправки смешайте соль, паприку, хмели-сунели, растительное масло и выдавленный чеснок.
3.Каждый кусочек картофеля макайте в заправку и выложите на противень, застеленный фольгой.
4.Отправьте картошку в духовку на 45-50 минут при температуре 180 градусов.
"""
    
    let borschtInfo = """
1.Мясо промыть, выложить в кипящую воду, варить до мягкости.
2.Картошку, лук свеклу, морковь, лук почистить.
3.Свеклу, морковь и лук обжарить на растительном масле.
4.Вытащить готовое мясо, выложить картошку.
5.Капусту нашинковать, выложить так же в бульон.
6.Затем выложить поджарку, довести до кипения и выключить.
7.Оставить под крышкой на полчаса.
"""
    
    let porkSkewers = """
1.Мясо промыли и нарезали на порционные кусочки.
2.Засыпали солью (по вашему вкусу) и перцем (кто любит поострее или пикантнее, можно будет добавить специи вами любимые) залить карачинской.
3.Оставляем мариноваться на ночь. Утром чистим лук, режем произвольно кому как нравиться и отправляем к мясу на час.
4.Жарим на углях до готовности. Всем приятного аппетита.
"""
    
    let caesarSalad = """
1.Куриную грудку отваренную нарезать крупными кусочками и обжарить на сильном огне в 1 ч. л. раст. масла.
2.Сухарики я делала сама из белого хлеба в духовке. Можно на сковороде нагреть олив.масло, добавить раздавленный зубчик чеснока, немного подержать. Чеснок достать, а сухарики положить жариться, тогда будет легкий чесночный вкус в салате.
3.Смешать сметану с горчицей, посолить, поперчить по вкусу.
4.Листья салата порвать. Яйца разрезать на 4 части или использовать перепелиные. Помидоры порезать. Если черри, то пополам, обычные помельче. Кто любит можно еще маслины, но КБЖУ написано без них).
5.Собрать салат, полить соусом, посыпать сыром и сухариками.
"""

}

